zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dma.h
  __IO HAL_DMA_StateTypeDef State;                                 /*!< DMA transfer state                      */

  __IO uint32_t             ErrorCode;                             /*!< DMA error code                          */

  void                      *Parent;                               /*!< Parent object state                     */

  void (* XferCpltCallback)(struct __DMA_HandleTypeDef *hdma);     /*!< DMA transfer complete callback          */

  void (* XferHalfCpltCallback)(struct __DMA_HandleTypeDef *hdma); /*!< DMA half transfer complete callback     */

  void (* XferErrorCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer error callback             */

  void (* XferAbortCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer Abort callback             */

  void (* XferSuspendCallback)(struct __DMA_HandleTypeDef *hdma);  /*!< DMA transfer Suspend callback           */

  struct __DMA_QListTypeDef  *LinkedListQueue;                     /*!< DMA linked-list queue                   */

} DMA_HandleTypeDef;
/**
  * @}
  */


/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @brief    DMA Exported constants
  * @{
  */

/** @defgroup DMA_Error_Codes DMA Error Codes
  * @brief    DMA Error Codes
  * @{
  */
#define HAL_DMA_ERROR_NONE             (0x0000U) /*!< No error                      */
#define HAL_DMA_ERROR_DTE              (0x0001U) /*!< Data transfer error           */
#define HAL_DMA_ERROR_ULE              (0x0002U) /*!< Update linked-list item error */
#define HAL_DMA_ERROR_USE              (0x0004U) /*!< User setting error            */
#define HAL_DMA_ERROR_TO               (0x0008U) /*!< Trigger overrun error         */
#define HAL_DMA_ERROR_TIMEOUT          (0x0010U) /*!< Timeout error                 */
#define HAL_DMA_ERROR_NO_XFER          (0x0020U) /*!< No transfer ongoing error     */
#define HAL_DMA_ERROR_BUSY             (0x0040U) /*!< Busy error                    */
#define HAL_DMA_ERROR_INVALID_CALLBACK (0x0080U) /*!< Invalid callback error        */
#define HAL_DMA_ERROR_NOT_SUPPORTED    (0x0100U) /*!< Not supported mode            */
/**
  * @}
  */

/** @defgroup DMA_Interrupt_Enable_Definition DMA Interrupt Enable Definition
  * @brief    DMA Interrupt Enable Definition
  * @{
  */
#define DMA_IT_TC   DMA_CCR_TCIE   /*!< Transfer complete interrupt             */
#define DMA_IT_HT   DMA_CCR_HTIE   /*!< Half transfer complete interrupt        */
#define DMA_IT_DTE  DMA_CCR_DTEIE  /*!< Data transfer error interrupt           */
#define DMA_IT_ULE  DMA_CCR_ULEIE  /*!< Update linked-list item error interrupt */
#define DMA_IT_USE  DMA_CCR_USEIE  /*!< User eetting error interrupt            */
#define DMA_IT_SUSP DMA_CCR_SUSPIE /*!< Completed suspension interrupt          */
#define DMA_IT_TO   DMA_CCR_TOIE   /*!< Trigger overrun interrupt               */
/**
  * @}
  */

/** @defgroup DMA_Flag_Definition DMA Flag Definition
  * @brief    DMA Flag Definition
  * @{
  */
#define DMA_FLAG_IDLE DMA_CSR_IDLEF /*!< Idle flag                          */
#define DMA_FLAG_TC   DMA_CSR_TCF   /*!< Transfer complete flag             */
#define DMA_FLAG_HT   DMA_CSR_HTF   /*!< Half transfer complete flag        */
#define DMA_FLAG_DTE  DMA_CSR_DTEF  /*!< Data transfer error flag           */
#define DMA_FLAG_ULE  DMA_CSR_ULEF  /*!< Update linked-list item error flag */
#define DMA_FLAG_USE  DMA_CSR_USEF  /*!< User setting error flag            */
#define DMA_FLAG_SUSP DMA_CSR_SUSPF /*!< Completed suspension flag          */
#define DMA_FLAG_TO   DMA_CSR_TOF   /*!< Trigger overrun flag               */
/**
  * @}
  */

/** @defgroup DMA_Request_Selection DMA Request Selection
  * @brief    DMA Request Selection
  * @{
  */
/* HPDMA requests */
#if defined (LPDMA)
#define HPDMA_REQUEST_FMC_TXRX   (0U)   /*!< HPDMA HW request is FMC_TXRX      */
#define HPDMA_REQUEST_FMC_BCH    (1U)   /*!< HPDMA HW request is FMC_BCH       */
#define HPDMA_REQUEST_OCTOSPI1   (2U)   /*!< HPDMA HW request is OCTOSPI1      */
#define HPDMA_REQUEST_OCTOSPI2   (3U)   /*!< HPDMA HW request is OCTOSPI2      */
#define HPDMA_REQUEST_CRYP1_IN   (4U)   /*!< HPDMA HW request is CRYP1_IN      */
#define HPDMA_REQUEST_CRYP1_OUT  (5U)   /*!< HPDMA HW request is CRYP1_OUT     */
#define HPDMA_REQUEST_HASH       (6U)   /*!< HPDMA HW request is HASH          */
#define HPDMA_REQUEST_SAES_OUT   (7U)   /*!< HPDMA HW request is SAES_OUT      */
#define HPDMA_REQUEST_SAES_IN    (8U)   /*!< HPDMA HW request is SAES_IN       */
#define HPDMA_REQUEST_USART1_RX  (9U)   /*!< HPDMA HW request is USART1_RX     */
#define HPDMA_REQUEST_USART1_TX  (10U)  /*!< HPDMA HW request is USART1_TX     */
#define HPDMA_REQUEST_USART2_RX  (11U)  /*!< HPDMA HW request is USART2_RX     */
#define HPDMA_REQUEST_USART2_TX  (12U)  /*!< HPDMA HW request is USART2_TX     */
#define HPDMA_REQUEST_USART3_RX  (13U)  /*!< HPDMA HW request is USART3_RX     */
#define HPDMA_REQUEST_USART3_TX  (14U)  /*!< HPDMA HW request is USART3_TX     */
#define HPDMA_REQUEST_UART4_RX   (15U)  /*!< HPDMA HW request is UART4_RX      */
#define HPDMA_REQUEST_UART4_TX   (16U)  /*!< HPDMA HW request is UART4_TX      */
#define HPDMA_REQUEST_UART5_RX   (17U)  /*!< HPDMA HW request is UART5_RX      */
#define HPDMA_REQUEST_UART5_TX   (18U)  /*!< HPDMA HW request is UART5_TX      */
#define HPDMA_REQUEST_USART6_RX  (19U)  /*!< HPDMA HW request is USART6_RX     */
#define HPDMA_REQUEST_USART6_TX  (20U)  /*!< HPDMA HW request is USART6_TX     */
#define HPDMA_REQUEST_UART7_RX   (21U)  /*!< HPDMA HW request is UART7_RX      */
#define HPDMA_REQUEST_UART7_TX   (22U)  /*!< HPDMA HW request is UART7_TX      */
#define HPDMA_REQUEST_UART8_RX   (23U)  /*!< HPDMA HW request is UART8_RX      */
#define HPDMA_REQUEST_UART8_TX   (24U)  /*!< HPDMA HW request is UART8_TX      */
#define HPDMA_REQUEST_UART9_RX   (25U)  /*!< HPDMA HW request is UART9_RX      */
#define HPDMA_REQUEST_UART9_TX   (26U)  /*!< HPDMA HW request is UART9_TX      */
#define HPDMA_REQUEST_I2C1_RX    (27U)  /*!< HPDMA HW request is I2C1_RX       */
#define HPDMA_REQUEST_I2C1_TX    (28U)  /*!< HPDMA HW request is I2C1_TX       */
#define HPDMA_REQUEST_I2C1_EVC   (29U)  /*!< HPDMA HW request is I2C1_EVC      */
#define HPDMA_REQUEST_I2C2_RX    (30U)  /*!< HPDMA HW request is I2C2_RX       */
#define HPDMA_REQUEST_I2C2_TX    (31U)  /*!< HPDMA HW request is I2C2_TX       */
#define HPDMA_REQUEST_I2C2_EVC   (32U)  /*!< HPDMA HW request is I2C2_EVC      */
#define HPDMA_REQUEST_I2C3_RX    (33U)  /*!< HPDMA HW request is I2C3_RX       */
#define HPDMA_REQUEST_I2C3_TX    (34U)  /*!< HPDMA HW request is I2C3_TX       */
#define HPDMA_REQUEST_I2C3_EVC   (35U)  /*!< HPDMA HW request is I2C3_EVC      */
#define HPDMA_REQUEST_I2C4_RX    (36U)  /*!< HPDMA HW request is I2C4_RX       */
#define HPDMA_REQUEST_I2C4_TX    (37U)  /*!< HPDMA HW request is I2C4_TX       */
#define HPDMA_REQUEST_I2C4_EVC   (38U)  /*!< HPDMA HW request is I2C4_EVC      */
#define HPDMA_REQUEST_I2C5_RX    (39U)  /*!< HPDMA HW request is I2C5_RX       */
#define HPDMA_REQUEST_I2C5_TX    (40U)  /*!< HPDMA HW request is I2C5_TX       */
#define HPDMA_REQUEST_I2C5_EVC   (41U)  /*!< HPDMA HW request is I2C5_EVC      */
#define HPDMA_REQUEST_I2C6_RX    (42U)  /*!< HPDMA HW request is I2C6_RX       */
#define HPDMA_REQUEST_I2C6_TX    (43U)  /*!< HPDMA HW request is I2C6_TX       */
#define HPDMA_REQUEST_I2C6_EVC   (44U)  /*!< HPDMA HW request is I2C6_EVC      */
#define HPDMA_REQUEST_I2C7_RX    (45U)  /*!< HPDMA HW request is I2C7_RX       */
#define HPDMA_REQUEST_I2C7_TX    (46U)  /*!< HPDMA HW request is I2C7_TX       */
#define HPDMA_REQUEST_I2C7_EVC   (47U)  /*!< HPDMA HW request is I2C7_EVC      */
#define HPDMA_REQUEST_RESERVED48 (48U)  /*!< HPDMA HW request is RESERVED      */
#define HPDMA_REQUEST_SPI1_RX    (49U)  /*!< HPDMA HW request is SPI1_RX       */
#define HPDMA_REQUEST_SPI1_TX    (50U)  /*!< HPDMA HW request is SPI1_TX       */
#define HPDMA_REQUEST_SPI2_RX    (51U)  /*!< HPDMA HW request is SPI2_RX       */
#define HPDMA_REQUEST_SPI2_TX    (52U)  /*!< HPDMA HW request is SPI2_TX       */
#define HPDMA_REQUEST_SPI3_RX    (53U)  /*!< HPDMA HW request is SPI3_RX       */
#define HPDMA_REQUEST_SPI3_TX    (54U)  /*!< HPDMA HW request is SPI3_TX       */
#define HPDMA_REQUEST_SPI4_RX    (55U)  /*!< HPDMA HW request is SPI4_RX       */
#define HPDMA_REQUEST_SPI4_TX    (56U)  /*!< HPDMA HW request is SPI4_TX       */
#define HPDMA_REQUEST_SPI5_RX    (57U)  /*!< HPDMA HW request is SPI5_RX       */
#define HPDMA_REQUEST_SPI5_TX    (58U)  /*!< HPDMA HW request is SPI5_TX       */
#define HPDMA_REQUEST_SPI6_RX    (59U)  /*!< HPDMA HW request is SPI6_RX       */
#define HPDMA_REQUEST_SPI6_TX    (60U)  /*!< HPDMA HW request is SPI6_TX       */
#define HPDMA_REQUEST_SPI7_RX    (61U)  /*!< HPDMA HW request is SPI7_RX       */
#define HPDMA_REQUEST_SPI7_TX    (62U)  /*!< HPDMA HW request is SPI7_TX       */
#define HPDMA_REQUEST_MDF1_FLT0  (63U)  /*!< HPDMA HW request is MDF1_FLT0     */
#define HPDMA_REQUEST_MDF1_FLT1  (64U)  /*!< HPDMA HW request is MDF1_FLT1     */
#define HPDMA_REQUEST_MDF1_FLT2  (65U)  /*!< HPDMA HW request is MDF1_FLT2     */
#define HPDMA_REQUEST_MDF1_FLT3  (66U)  /*!< HPDMA HW request is MDF1_FLT3     */
#define HPDMA_REQUEST_MDF1_FLT4  (67U)  /*!< HPDMA HW request is MDF1_FLT4     */
#define HPDMA_REQUEST_MDF1_FLT5  (68U)  /*!< HPDMA HW request is MDF1_FLT5     */
#define HPDMA_REQUEST_MDF1_FLT6  (69U)  /*!< HPDMA HW request is MDF1_FLT6     */
#define HPDMA_REQUEST_MDF1_FLT7  (70U)  /*!< HPDMA HW request is MDF1_FLT7     */
#define HPDMA_REQUEST_SPDIFRX_DT (71U)  /*!< HPDMA HW request is SPDIFRX_DT    */
#define HPDMA_REQUEST_SPDIFRX_CS (72U)  /*!< HPDMA HW request is SPDIFRX_CS    */
#define HPDMA_REQUEST_SAI1_A     (73U)  /*!< HPDMA HW request is SAI1_A        */
#define HPDMA_REQUEST_SAI1_B     (74U)  /*!< HPDMA HW request is SAI1_B        */
#define HPDMA_REQUEST_SAI2_A     (75U)  /*!< HPDMA HW request is SAI2_A        */
#define HPDMA_REQUEST_SAI2_B     (76U)  /*!< HPDMA HW request is SAI2_B        */
#define HPDMA_REQUEST_SAI3_A     (77U)  /*!< HPDMA HW request is SAI3_A        */
#define HPDMA_REQUEST_SAI3_B     (78U)  /*!< HPDMA HW request is SAI3_B        */
#define HPDMA_REQUEST_SAI4_A     (79U)  /*!< HPDMA HW request is SAI4_A        */
#define HPDMA_REQUEST_SAI4_B     (80U)  /*!< HPDMA HW request is SAI4_B        */
#define HPDMA_REQUEST_ADC1       (81U)  /*!< HPDMA HW request is ADC1          */
#define HPDMA_REQUEST_ADC2       (82U)  /*!< HPDMA HW request is ADC2          */
#define HPDMA_REQUEST_ADC3       (83U)  /*!< HPDMA HW request is ADC3          */
#define HPDMA_REQUEST_TIM1_CH1   (84U)  /*!< HPDMA HW request is TIM1_CH1      */
#define HPDMA_REQUEST_TIM1_CH2   (85U)  /*!< HPDMA HW request is TIM1_CH2      */
#define HPDMA_REQUEST_TIM1_CH3   (86U)  /*!< HPDMA HW request is TIM1_CH3      */
#define HPDMA_REQUEST_TIM1_CH4   (87U)  /*!< HPDMA HW request is TIM1_CH4      */
#define HPDMA_REQUEST_TIM1_UP    (88U)  /*!< HPDMA HW request is TIM1_UP       */
#define HPDMA_REQUEST_TIM1_TRIG  (89U)  /*!< HPDMA HW request is TIM1_TRIG     */
#define HPDMA_REQUEST_TIM1_COM   (90U)  /*!< HPDMA HW request is TIM1_COM      */
#define HPDMA_REQUEST_TIM2_CH1   (91U)  /*!< HPDMA HW request is TIM2_CH1      */
#define HPDMA_REQUEST_TIM2_CH2   (92U)  /*!< HPDMA HW request is TIM2_CH2      */
#define HPDMA_REQUEST_TIM2_CH3   (93U)  /*!< HPDMA HW request is TIM2_CH3      */
#define HPDMA_REQUEST_TIM2_CH4   (94U)  /*!< HPDMA HW request is TIM2_CH4      */
#define HPDMA_REQUEST_TIM2_UP    (95U)  /*!< HPDMA HW request is TIM2_UP       */
#define HPDMA_REQUEST_TIM3_CH1   (96U)  /*!< HPDMA HW request is TIM3_CH1      */
#define HPDMA_REQUEST_TIM3_CH2   (97U)  /*!< HPDMA HW request is TIM3_CH2      */
#define HPDMA_REQUEST_TIM3_CH3   (98U)  /*!< HPDMA HW request is TIM3_CH3      */
#define HPDMA_REQUEST_TIM3_CH4   (99U)  /*!< HPDMA HW request is TIM3_CH4      */
#define HPDMA_REQUEST_TIM3_UP    (100U) /*!< HPDMA HW request is TIM3_UP       */
#define HPDMA_REQUEST_TIM3_TRIG  (101U) /*!< HPDMA HW request is TIM3_TRIG     */
#define HPDMA_REQUEST_TIM4_CH1   (102U) /*!< HPDMA HW request is TIM4_CH1      */
#define HPDMA_REQUEST_TIM4_CH2   (103U) /*!< HPDMA HW request is TIM4_CH2      */
#define HPDMA_REQUEST_TIM4_CH3   (104U) /*!< HPDMA HW request is TIM4_CH3      */
#define HPDMA_REQUEST_TIM4_UP    (105U) /*!< HPDMA HW request is TIM4_UP       */
#define HPDMA_REQUEST_TIM5_CH1   (106U) /*!< HPDMA HW request is TIM5_CH1      */
#define HPDMA_REQUEST_TIM5_CH2   (107U) /*!< HPDMA HW request is TIM5_CH2      */
#define HPDMA_REQUEST_TIM5_CH3   (108U) /*!< HPDMA HW request is TIM5_CH3      */
#define HPDMA_REQUEST_TIM5_CH4   (109U) /*!< HPDMA HW request is TIM5_CH4      */
#define HPDMA_REQUEST_TIM5_UP    (110U) /*!< HPDMA HW request is TIM5_UP       */
#define HPDMA_REQUEST_TIM5_TRIG  (111U) /*!< HPDMA HW request is TIM5_TRIG     */
#define HPDMA_REQUEST_TIM6_UP    (112U) /*!< HPDMA HW request is TIM6_UP       */
#define HPDMA_REQUEST_TIM7_UP    (113U) /*!< HPDMA HW request is TIM7_UP       */
#define HPDMA_REQUEST_TIM8_CH1   (114U) /*!< HPDMA HW request is TIM8_CH1      */
#define HPDMA_REQUEST_TIM8_CH2   (115U) /*!< HPDMA HW request is TIM8_CH2      */
#define HPDMA_REQUEST_TIM8_CH3   (116U) /*!< HPDMA HW request is TIM8_CH3      */
#define HPDMA_REQUEST_TIM8_CH4   (117U) /*!< HPDMA HW request is TIM8_CH4      */
#define HPDMA_REQUEST_TIM8_UP    (118U) /*!< HPDMA HW request is TIM8_UP       */
#define HPDMA_REQUEST_TIM8_TRIG  (119U) /*!< HPDMA HW request is TIM8_TRIG     */
#define HPDMA_REQUEST_TIM8_COM   (120U) /*!< HPDMA HW request is TIM8_COM      */
#define HPDMA_REQUEST_TIM15_CH1  (121U) /*!< HPDMA HW request is TIM15_CH1     */
#define HPDMA_REQUEST_TIM15_UP   (122U) /*!< HPDMA HW request is TIM15_UP      */
#define HPDMA_REQUEST_TIM15_TRIG (123U) /*!< HPDMA HW request is TIM15_TRIG    */
#define HPDMA_REQUEST_TIM15_COM  (124U) /*!< HPDMA HW request is TIM15_COM     */
#define HPDMA_REQUEST_TIM16_CH1  (125U) /*!< HPDMA HW request is TIM16_CH1     */
#define HPDMA_REQUEST_TIM16_UP   (126U) /*!< HPDMA HW request is TIM16_UP      */
#define HPDMA_REQUEST_TIM17_CH1  (127U) /*!< HPDMA HW request is TIM17_CH1     */
#define HPDMA_REQUEST_TIM17_UP   (128U) /*!< HPDMA HW request is TIM17_UP      */
#define HPDMA_REQUEST_TIM20_CH1  (129U) /*!< HPDMA HW request is TIM20_CH1     */
#define HPDMA_REQUEST_TIM20_CH2  (130U) /*!< HPDMA HW request is TIM20_CH2     */
#define HPDMA_REQUEST_TIM20_CH3  (131U) /*!< HPDMA HW request is TIM20_CH3     */
#define HPDMA_REQUEST_TIM20_CH4  (132U) /*!< HPDMA HW request is TIM20_CH4     */
#define HPDMA_REQUEST_TIM20_UP   (133U) /*!< HPDMA HW request is TIM20_UP      */
#define HPDMA_REQUEST_TIM20_TRIG (134U) /*!< HPDMA HW request is TIM20_TRIG    */
#define HPDMA_REQUEST_TIM20_COM  (135U) /*!< HPDMA HW request is TIM20_COM     */
#define HPDMA_REQUEST_PCIE       (136U) /*!< HPDMA HW request is PCIE          */
#define HPDMA_REQUEST_DCMI       (137U) /*!< HPDMA HW request is DCMI          */
#define HPDMA_REQUEST_UCPD_TX    (138U) /*!< HPDMA HW request is UCPD_TX       */
#define HPDMA_REQUEST_UCPD_RX    (139U) /*!< HPDMA HW request is UCPD_RX       */
#define HPDMA_REQUEST_CRYP2_IN   (140U) /*!< HPDMA HW request is CRYP2_IN      */
#define HPDMA_REQUEST_CRYP2_OUT  (141U) /*!< HPDMA HW request is CRYP2_OUT     */
#define HPDMA_REQUEST_TIM4_CH4   (142U) /*!< HPDMA HW request is TIM4_CH4      */
#define HPDMA_REQUEST_LPTIM1_IC1 (143U) /*!< HPDMA HW request is LPTIM1_IC1    */
#define HPDMA_REQUEST_LPTIM1_IC2 (144U) /*!< HPDMA HW request is LPTIM1_IC2    */
#define HPDMA_REQUEST_LPTIM1_UE  (145U) /*!< HPDMA HW request is LPTIM1_UE     */
#define HPDMA_REQUEST_LPTIM2_IC1 (146U) /*!< HPDMA HW request is LPTIM2_IC1    */
#define HPDMA_REQUEST_LPTIM2_IC2 (147U) /*!< HPDMA HW request is LPTIM2_IC2    */
#define HPDMA_REQUEST_LPTIM2_UE  (148U) /*!< HPDMA HW request is LPTIM2_UE     */
#define HPDMA_REQUEST_TIM2_TRIG  (149U) /*!< HPDMA HW request is TIM2_TRIG     */
#define HPDMA_REQUEST_TIM4_TRIG  (150U) /*!< HPDMA HW request is TIM4_TRIG     */
#define HPDMA_REQUEST_TIM15_CH2  (151U) /*!< HPDMA HW request is TIM15_CH2     */
#define HPDMA_REQUEST_TIM16_COM  (152U) /*!< HPDMA HW request is TIM16_COM     */
#define HPDMA_REQUEST_TIM17_COM  (153U) /*!< HPDMA HW request is TIM17_COM     */
#define HPDMA_REQUEST_I3C1_RX    (154U) /*!< HPDMA HW request is I3C1_RX       */
#define HPDMA_REQUEST_I3C1_TX    (155U) /*!< HPDMA HW request is I3C1_TX       */
#define HPDMA_REQUEST_I3C1_CMD   (156U) /*!< HPDMA HW request is I3C1_CMD      */
#define HPDMA_REQUEST_I3C1_STAT  (157U) /*!< HPDMA HW request is I3C1_STAT     */
#define HPDMA_REQUEST_I3C2_RX    (158U) /*!< HPDMA HW request is I3C2_RX       */
#define HPDMA_REQUEST_I3C2_TX    (159U) /*!< HPDMA HW request is I3C2_TX       */
#define HPDMA_REQUEST_I3C2_CMD   (160U) /*!< HPDMA HW request is I3C2_CMD      */
#define HPDMA_REQUEST_I3C2_STAT  (161U) /*!< HPDMA HW request is I3C2_STAT     */
#define HPDMA_REQUEST_I3C3_RX    (162U) /*!< HPDMA HW request is I3C3_RX       */
#define HPDMA_REQUEST_I3C3_TX    (163U) /*!< HPDMA HW request is I3C3_TX       */
#define HPDMA_REQUEST_I3C3_CMD   (164U) /*!< HPDMA HW request is I3C3_CMD      */
#define HPDMA_REQUEST_I3C3_STAT  (165U) /*!< HPDMA HW request is I3C3_STAT     */
#if !defined(STM32MP25XX_SI_CUT1_X)
#define HPDMA_REQUEST_LPUART1_RX (166U) /*!< HPDMA HW request is LPUART1_RX    */
#define HPDMA_REQUEST_LPUART1_TX (167U) /*!< HPDMA HW request is LPUART1_TX    */
#define HPDMA_REQUEST_I2C8_RX    (168U) /*!< HPDMA HW request is I2C8_RX       */
#define HPDMA_REQUEST_I2C8_TX    (169U) /*!< HPDMA HW request is I2C8_TX       */
#define HPDMA_REQUEST_I2C8_EVC   (170U) /*!< HPDMA HW request is I2C8_EVC      */
#define HPDMA_REQUEST_SPI8_RX    (171U) /*!< HPDMA HW request is SPI8_RX       */
#define HPDMA_REQUEST_SPI8_TX    (172U) /*!< HPDMA HW request is SPI8_TX       */
#define HPDMA_REQUEST_ADF1_FLT0  (173U) /*!< HPDMA HW request is ADF1_FLT0     */
#define HPDMA_REQUEST_LPTIM3_IC1 (174U) /*!< HPDMA HW request is LPTIM3_IC1    */
#define HPDMA_REQUEST_LPTIM3_IC2 (175U) /*!< HPDMA HW request is LPTIM3_IC2    */
#define HPDMA_REQUEST_LPTIM3_UE  (176U) /*!< HPDMA HW request is LPTIM3_UE     */
#define HPDMA_REQUEST_LPTIM4_IC1 (177U) /*!< HPDMA HW request is LPTIM4_IC1    */
#define HPDMA_REQUEST_LPTIM4_IC2 (178U) /*!< HPDMA HW request is LPTIM4_IC2    */
#define HPDMA_REQUEST_LPTIM4_UE  (179U) /*!< HPDMA HW request is LPTIM4_UE     */
#define HPDMA_REQUEST_I3C4_RX    (180U) /*!< HPDMA HW request is I3C4_RX       */
#define HPDMA_REQUEST_I3C4_TX    (181U) /*!< HPDMA HW request is I3C4_TX       */
#define HPDMA_REQUEST_I3C4_CMD   (182U) /*!< HPDMA HW request is I3C4_CMD      */
#define HPDMA_REQUEST_I3C4_STAT  (183U) /*!< HPDMA HW request is I3C4_STAT     */
#endif /* ! STM32MP25XX_SI_CUT1_X */

/* LPDMA requests */
#define LPDMA_REQUEST_LPUART1_RX (0U)   /*!< LPDMA HW request is LPUART1_RX    */
#define LPDMA_REQUEST_LPUART1_TX (1U)   /*!< LPDMA HW request is LPUART1_TX    */
#define LPDMA_REQUEST_I2C8_RX    (2U)   /*!< LPDMA HW request is I2C8_RX       */
#define LPDMA_REQUEST_I2C8_TX    (3U)   /*!< LPDMA HW request is I2C8_TX       */
#define LPDMA_REQUEST_I2C8_EVC   (4U)   /*!< LPDMA HW request is I2C8_EVC      */
#define LPDMA_REQUEST_SPI8_RX    (5U)   /*!< LPDMA HW request is SPI8_RX       */
#define LPDMA_REQUEST_SPI8_TX    (6U)   /*!< LPDMA HW request is SPI8_TX       */
#define LPDMA_REQUEST_ADF1_FLT0  (7U)   /*!< LPDMA HW request is ADF1_FLT0     */
#define LPDMA_REQUEST_LPTIM3_IC1 (8U)   /*!< LPDMA HW request is LPTIM3_IC1    */
#define LPDMA_REQUEST_LPTIM3_IC2 (9U)   /*!< LPDMA HW request is LPTIM3_IC2    */
#define LPDMA_REQUEST_LPTIM3_UE  (10U)  /*!< LPDMA HW request is LPTIM3_UE     */
#define LPDMA_REQUEST_LPTIM4_IC1 (11U)  /*!< LPDMA HW request is LPTIM4_IC1    */
#define LPDMA_REQUEST_LPTIM4_IC2 (12U)  /*!< LPDMA HW request is LPTIM4_IC2    */
#define LPDMA_REQUEST_LPTIM4_UE  (13U)  /*!< LPDMA HW request is LPTIM4_UE     */
#define LPDMA_REQUEST_I3C4_RX    (15U)  /*!< LPDMA HW request is I3C4_RX       */
#define LPDMA_REQUEST_I3C4_TX    (16U)  /*!< LPDMA HW request is I3C4_TX       */
#define LPDMA_REQUEST_I3C4_CMD   (17U)  /*!< LPDMA HW request is I3C4_CMD      */
#define LPDMA_REQUEST_I3C4_STAT  (18U)  /*!< LPDMA HW request is I3C4_STAT     */

/* Software request */
#define DMA_REQUEST_SW            DMA_CTR2_SWREQ /*!< DMA SW request           */

#else

