zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dma.h
#define IS_DMA_PRIORITY(PRIORITY)                  \
  (((PRIORITY) == DMA_LOW_PRIORITY_LOW_WEIGHT)  || \
   ((PRIORITY) == DMA_LOW_PRIORITY_MID_WEIGHT)  || \
   ((PRIORITY) == DMA_LOW_PRIORITY_HIGH_WEIGHT) || \
   ((PRIORITY) == DMA_HIGH_PRIORITY))

#define  IS_DMA_TRANSFER_ALLOCATED_PORT(ALLOCATED_PORT) \
  (((ALLOCATED_PORT) & (~(DMA_CTR1_SAP | DMA_CTR1_DAP))) == 0U)

#if  defined(I3C4)
#define IS_DMA_REQUEST(REQUEST)     \
  (((REQUEST) == DMA_REQUEST_SW) || \
   ((REQUEST) <= HPDMA_REQUEST_I3C4_STAT))
#else /* I3C4 */
#define IS_DMA_REQUEST(REQUEST)     \
  (((REQUEST) == DMA_REQUEST_SW) || \
   ((REQUEST) <= HPDMA_REQUEST_HASH2))
#endif /* I3C4 */

#define IS_DMA_BLOCK_HW_REQUEST(MODE)   \
  (((MODE) == DMA_BREQ_SINGLE_BURST) || \
   ((MODE) == DMA_BREQ_BLOCK))

#define IS_DMA_TCEM_EVENT_MODE(MODE)               \
  (((MODE) == DMA_TCEM_BLOCK_TRANSFER)          || \
   ((MODE) == DMA_TCEM_REPEATED_BLOCK_TRANSFER) || \
   ((MODE) == DMA_TCEM_EACH_LL_ITEM_TRANSFER)   || \
   ((MODE) == DMA_TCEM_LAST_LL_ITEM_TRANSFER))

#define IS_DMA_BLOCK_SIZE(SIZE) \
  (((SIZE) > 0U) && ((SIZE) <= DMA_CBR1_BNDT))

#if defined CORTEX_IN_SECURE_STATE
#define IS_DMA_ATTRIBUTES(ATTRIBUTE)  \
  (((((ATTRIBUTE) & DMA_CHANNEL_INVALID_ATTR_VALUE_MASK) == 0U)                                       && \
    (((ATTRIBUTE) & DMA_CHANNEL_VALID_ATTR_VALUE_MASK) != 0U))                                         ? \
   ((((ATTRIBUTE) & DMA_CHANNEL_ATTR_CID_DYNAMIC_SELECT) == DMA_CHANNEL_ATTR_CID_DYNAMIC_SELECT)   || \
    (((ATTRIBUTE) & DMA_CHANNEL_ATTR_CID_STATIC_SELECT ) == DMA_CHANNEL_ATTR_CID_STATIC_SELECT)    || \
    (((ATTRIBUTE) & DMA_CHANNEL_CID_DISABLE            ) == DMA_CHANNEL_CID_DISABLE)               || \
    (((ATTRIBUTE) & DMA_CHANNEL_ATTR_SEC_MASK          ) == DMA_CHANNEL_ATTR_SEC_MASK)             || \
    (((ATTRIBUTE) & DMA_CHANNEL_ATTR_SEC_SRC_MASK      ) == DMA_CHANNEL_ATTR_SEC_SRC_MASK)         || \
    (((ATTRIBUTE) & DMA_CHANNEL_ATTR_SEC_DEST_MASK     ) == DMA_CHANNEL_ATTR_SEC_DEST_MASK)        || \
    (((ATTRIBUTE) & DMA_CHANNEL_ATTR_PRIV_MASK         ) == DMA_CHANNEL_ATTR_PRIV_MASK))            : \
   RESET)
#else
#define IS_DMA_ATTRIBUTES(ATTRIBUTE)  \
  (((((ATTRIBUTE) & DMA_CHANNEL_INVALID_ATTR_VALUE_MASK) == 0U)                                       && \
    (((ATTRIBUTE) & DMA_CHANNEL_VALID_ATTR_VALUE_MASK) != 0U))                                        ? \
   ((((ATTRIBUTE) & DMA_CHANNEL_ATTR_CID_DYNAMIC_SELECT) == DMA_CHANNEL_ATTR_CID_DYNAMIC_SELECT)   || \
    (((ATTRIBUTE) & DMA_CHANNEL_ATTR_CID_STATIC_SELECT ) == DMA_CHANNEL_ATTR_CID_STATIC_SELECT)    || \
    (((ATTRIBUTE) & DMA_CHANNEL_CID_DISABLE            ) == DMA_CHANNEL_CID_DISABLE)               || \
    (((ATTRIBUTE) & DMA_CHANNEL_ATTR_PRIV_MASK         ) == DMA_CHANNEL_ATTR_PRIV_MASK))            : \
   RESET)
#endif /* CORTEX_IN_SECURE_STATE */

#if defined CORTEX_IN_SECURE_STATE
#define IS_DMA_GLOBAL_ACTIVE_FLAG_S(INSTANCE, GLOBAL_FLAG) \
  (((INSTANCE)->SMISR & (GLOBAL_FLAG)))
#endif /* CORTEX_IN_SECURE_STATE */
#define IS_DMA_GLOBAL_ACTIVE_FLAG_NS(INSTANCE, GLOBAL_FLAG) \
  (((INSTANCE)->MISR & (GLOBAL_FLAG)))

/**
  * @}
  */


/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Private_Functions DMA Private Functions
  * @brief    DMA Private Functions
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_DMA_H */
